public class PsuedoCodeHowTo {
    public static void main(String[] args) {
        // 당장 코드는 못 만들겠고
        // 생각한 내용은 있을때 의사 코드를 작성하는 방법

        // Q. if 문으로 다시 돌아가라고 코딩하고싶은데... 잘 안돼네요.
        // A. 다시 돌아가라는건 ? 현재 조건이 안되니까 다시 해오라는 뜻(조건이 맞을때까지 반복)
        //    재수생: 원하는 결과가 나올때까지 반복 <<<
        //    편입생: 원하는 결과가 나올때까지 반복 <<<
        //    각자 원하는 결과는 다르지만 반복함 <<< 반복 (while, for)

        // 65 ~ 122 사이의 랜덤한 문자를 생성하도록 한다.
        // 여기서 소문자나 대문자가 아니라면 다시 생성하도록 프로그램을 만들어보자

        // 1) 난수 생성(65 ~ 122)
        // 2) 대/소문자 비교
        // 3) 대/소문자가 아니면 반복해서 1번 다시
    }
}
