public class Ans8 {
    public static void main(String[] args) {
        /*  2명이 주사위 게임을 한다. (배열 활용)
            주사위는 각자 2개씩 굴릴 수 있다.
            처음 주사위를 굴렸을때 결과가 짝수라면 한 번 더 돌릴 수 있다.
            (2, 4, 6, 8, 10, 12)

            한 번 더 돌리는 주사위는 특수 스킬을 가지고 있다.
            (특수 스킬 주사위는 1번만 굴린다)
            이 특수 스킬들은 1, 3, 4, 6에서 동작한다.

            1번의 경우 상대방의 주사위 눈금을 2 떨군다.
            3번의 경우 다 같이 -6을 적용한다. (결과는 0 이하로 떨어지지 않는다 - 무승부 노리기)
            4번의 경우 그냥 패배 처리한다.
            6번의 경우 모든 상대방에게 3을 뺏어서 내거에 3을 더한다.
            2번, 5번은 그냥 특수 스킬이 동작하지 않고 단순히 더해진다. */
    }
}
